axf33480/ESP32CommandStation/main/ConfigurationManager.cpp
/**********************************************************************
ESP32 COMMAND STATION

COPYRIGHT (c) 2017-2020 Mike Dunston

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
  You should have received a copy of the GNU General Public License
  along with this program.  If not, see http://www.gnu.org/licenses
**********************************************************************/

#include "ESP32CommandStation.h"

#include <dirent.h>
#include <driver/sdmmc_defs.h>
#include <driver/sdmmc_host.h>
#include <driver/sdmmc_types.h>
#include <driver/sdspi_host.h>
#include <esp_spiffs.h>
#include <esp_vfs_fat.h>
#include <Httpd.h>
#include <sdmmc_cmd.h>
#include <sys/stat.h>
#include <sys/types.h>

using nlohmann::json;

// global instance of the ConfigurationManager
unique_ptr<ConfigurationManager> configStore;

static constexpr const char ESP32_CS_CONFIG_JSON[] = "esp32cs-config.json";

// Global handle for WiFi Manager
unique_ptr<Esp32WiFiManager> wifiManager;

// holder of the parsed configuration.
json csConfig;

#ifdef DEDICATED_MODULE_EXECUTOR
// executor used for all modules to offload them from the core LCC excutor
static Executor<1> moduleExecutor{NO_THREAD()};
static Service moduleService(&moduleExecutor);
#endif

extern unique_ptr<SimpleCanStack> lccStack;

// CDI Helper which sets the provided path if it is different than the value
// passed in.
#define CDI_COMPARE_AND_SET(PATH, fd, value, updated) \
  {                                                   \
    auto current = PATH().read(fd);                   \
    if (current != value)                             \
    {                                                 \
      PATH().write(fd, value);                        \
      updated = true;                                 \
    }                                                 \
  }

// Helper which will trigger a config reload event to be queued when
// updated is true.
#define MAYBE_TRIGGER_UPDATE(updated)                      \
  if (updated)                                             \
  {                                                        \
    lccStack->executor()->add(new CallbackExecutable([]()  \
    {                                                      \
      lccStack->config_service()->trigger_update();        \
    }));                                                   \
  }

// Helper which will trigger a config reload event to be queued when
// updated is true.
#define SCHEDULE_REBOOT()                               \
  lccStack->executor()->add(new CallbackExecutable([]() \
  {                                                     \
    reboot();                                           \
  }));

// Helper which converts a string to a uint64 value.
static inline uint64_t string_to_uint64(string value)
{
  // remove period characters if present
  value.erase(std::remove(value.begin(), value.end(), '.'), value.end());
  // convert the string to a uint64_t value
  return std::stoull(value, nullptr, 16);
}

void recursiveWalkTree(const string &path, bool remove=false)
{
  DIR *dir = opendir(path.c_str());
  if (dir)
  {
    dirent *ent = NULL;
    while ((ent = readdir(dir)) != NULL)
    {
      string fullPath = path + "/" + ent->d_name;
      if (ent->d_type == DT_REG)
      {
        struct stat statbuf;
        stat(fullPath.c_str(), &statbuf);
        if (remove)
        {
          LOG(VERBOSE, "[Config] Deleting %s (%lu bytes)", fullPath.c_str()
            , statbuf.st_size);
          ERRNOCHECK(fullPath.c_str(), unlink(fullPath.c_str()));
        }
        else
        {
          LOG(INFO, "[Config] %s (%lu bytes) mtime: %s", fullPath.c_str()
            , statbuf.st_size, ctime(&statbuf.st_mtime));
        }
      }
      else if (ent->d_type == DT_DIR)
      {
        recursiveWalkTree(fullPath, remove);
      }
    }
    closedir(dir);
    if (remove)
    {
      rmdir(path.c_str());
    }
  }
  else
  {
    LOG_ERROR("[Config] Failed to open directory: %s", path.c_str());
  }
}

ConfigurationManager::ConfigurationManager(const esp32cs::Esp32ConfigDef &cfg)
  : cfg_(cfg)
{
#if CONFIG_ESP32CS_FORCE_FACTORY_RESET
  bool factory_reset_config{true};
#else
  bool factory_reset_config{false};
#endif
#if CONFIG_LCC_FACTORY_RESET
  bool lcc_factory_reset{true};
#else
  bool lcc_factory_reset{false};
#endif
  bool persist_config{true};
  struct stat statbuf;

  sdmmc_host_t sd_host = SDSPI_HOST_DEFAULT();
  sdspi_slot_config_t sd_slot = SDSPI_SLOT_CONFIG_DEFAULT();
  esp_vfs_fat_sdmmc_mount_config_t sd_cfg =
  {
    .format_if_mount_failed = true,
    .max_files = 5,
    .allocation_unit_size = 16 * 1024
  };
  esp_err_t err = esp_vfs_fat_sdmmc_mount(CFG_MOUNT, &sd_host, &sd_slot
                                        , &sd_cfg, &sd_);
  if (err == ESP_OK)
  {
    LOG(INFO, "[Config] SD card mounted successfully.");
    FATFS *fsinfo;
    DWORD clusters;
    if (f_getfree("0:", &clusters, &fsinfo) == FR_OK)
    {
      LOG(INFO, "[Config] SD usage: %.2f/%.2f MB",
          (float)(((uint64_t)fsinfo->csize *
                  (fsinfo->n_fatent - 2 - fsinfo->free_clst)) *
                  fsinfo->ssize) / 1048576L,
          (float)(((uint64_t)fsinfo->csize * (fsinfo->n_fatent - 2)) *
                  fsinfo->ssize) / 1048576L);
    }
    else
    {
      LOG(INFO, "[Config] SD capacity %.2f MB",
          (float)(((uint64_t)sd_->csd.capacity) *
                  sd_->csd.sector_size) / 1048576);
    }
    LOG(INFO, "[Config] SD will be used for persistent storage.");
  }
  else
  {
    // unmount the SD VFS since it failed to successfully mount. We will
    // remount SPIFFS in it's place instead.
    esp_vfs_fat_sdmmc_unmount();
    LOG(INFO, "[Config] SD Card not present or mounting failed, using SPIFFS");
    esp_vfs_spiffs_conf_t conf =
    {
      .base_path = CFG_MOUNT,
      .partition_label = NULL,
      .max_files = 5,
      .format_if_mount_failed = true
    };
    // Attempt to mount the partition
    ESP_ERROR_CHECK(esp_vfs_spiffs_register(&conf));
    // check that the partition mounted
    size_t total = 0, used = 0;
    if (esp_spiffs_info(NULL, &total, &used) == ESP_OK)
    {
      LOG(INFO, "[Config] SPIFFS usage: %.2f/%.2f KiB", (float)(used / 1024.0f)
        , (float)(total / 1024.0f));
    }
    else
    {
      LOG_ERROR("[Config] Unable to retrieve SPIFFS utilization statistics.");
    }
    LOG(INFO, "[Config] SPIFFS will be used for persistent storage.");
  }

