axf33480/ESP32CommandStation/main/ConfigurationManager.cpp
void ConfigurationManager::store(const char *name, const string &content)
{
  string configFilePath = getFilePath(name);
  LOG(VERBOSE, "[Config] Storing %s, %d bytes", configFilePath.c_str()
    , content.length());
  write_string_to_file(configFilePath, content);
}

void ConfigurationManager::factory_reset()
{
  remove(ESP32_CS_CONFIG_JSON);
  SCHEDULE_REBOOT();
}

void ConfigurationManager::factory_reset_lcc(bool warn)
{
  struct stat statbuf;
  // this code is not using access(path, F_OK) as that is not available for
  // SPIFFS VFS. stat(path, buf) does work though.
  if (!stat(LCC_CONFIG_FILE, &statbuf) || !stat(LCC_CDI_XML, &statbuf))
  {
    if (warn)
    {
      LOG(WARNING, "[Config] LCC factory reset underway...");
    }

    if (!stat(LCC_CONFIG_FILE, &statbuf))
    {
      LOG(WARNING, "[Config] Removing %s", LCC_CONFIG_FILE);
      ERRNOCHECK(LCC_CONFIG_FILE, unlink(LCC_CONFIG_FILE));
    }
    if (!stat(LCC_CDI_XML, &statbuf))
    {
      LOG(WARNING, "[Config] Removing %s", LCC_CDI_XML);
      ERRNOCHECK(LCC_CDI_XML, unlink(LCC_CDI_XML));
    }
    if (warn)
    {
      LOG(WARNING
        , "[Config] The ESP32 CommandStation needs to be restarted in order "
          "to complete the factory reset.");
    }
  }
}

NodeID ConfigurationManager::getNodeId()
{
  auto lccConfig = csConfig[JSON_LCC_NODE];
  return (NodeID)lccConfig[JSON_LCC_NODE_ID_NODE].get<uint64_t>();
}

bool ConfigurationManager::setNodeID(string value)
{
  LOG(VERBOSE, "[Config] Current NodeID: %s, updated NodeID: %s"
    , uint64_to_string_hex(getNodeId()).c_str(), value.c_str());
  uint64_t new_node_id = string_to_uint64(value);
  if (new_node_id != getNodeId())
  {
    LOG(INFO
      , "[Config] Persisting NodeID: %s and enabling forced factory_reset."
      , uint64_to_string_hex(new_node_id).c_str());
    csConfig[JSON_LCC_NODE][JSON_LCC_NODE_ID_NODE] = new_node_id;
    csConfig[JSON_LCC_NODE][JSON_LCC_FORCE_RESET_NODE] = true;
    persistConfig();
    SCHEDULE_REBOOT();
    return true;
  }
  return false;
}

#ifndef CONFIG_LCC_SD_FSYNC_SEC
#define CONFIG_LCC_SD_FSYNC_SEC 10
#endif

void ConfigurationManager::configureLCC()
{
  auto lccConfig = csConfig[JSON_LCC_NODE];
  if (lccConfig.contains(JSON_LCC_CAN_NODE))
  {
    auto canConfig = lccConfig[JSON_LCC_CAN_NODE];
    bool canEnabled = canConfig[JSON_LCC_CAN_ENABLED_NODE];
    gpio_num_t canRXPin =
      (gpio_num_t)canConfig[JSON_LCC_CAN_RX_NODE].get<uint8_t>();
    gpio_num_t canTXPin =
      (gpio_num_t)canConfig[JSON_LCC_CAN_TX_NODE].get<uint8_t>();
    if (canEnabled && canRXPin < GPIO_NUM_MAX && canTXPin < GPIO_NUM_MAX)
    {
      LOG(INFO, "[Config] Enabling LCC CAN interface (rx: %d, tx: %d)"
        , canRXPin, canTXPin);
// TODO: re-introduce CAN interface after reimplementing as HubFlow
//      openmrn->add_can_port(
//        new Esp32HardwareCan("esp32can", canRXPin, canTXPin, false));
    }
  }

  // Create the CDI.xml dynamically if it doesn't already exist.
  CDIHelper::create_config_descriptor_xml(cfg_, LCC_CDI_XML, true);

  // Create the default internal configuration file if it doesn't already exist.
  configFd_ =
    lccStack->create_config_file_if_needed(cfg_.seg().internal_config()
                                         , CONFIG_ESP32CS_CDI_VERSION
                                         , openlcb::CONFIG_FILE_SIZE);

  if (sd_)
  {
    // ESP32 FFat library uses a 512b cache in memory by default for the SD VFS
    // adding a periodic fsync call for the LCC configuration file ensures that
    // config changes are saved since the LCC config file is less than 512b.
    LOG(INFO, "[Config] Creating automatic fsync(%d) calls every %d seconds."
      , configFd_, CONFIG_LCC_SD_FSYNC_SEC);
    configAutoSync_.reset(new AutoSyncFileFlow(lccStack->service()
                        , configFd_
                        , SEC_TO_USEC(CONFIG_LCC_SD_FSYNC_SEC)));
  }
#if CONFIG_LCC_PRINT_ALL_PACKETS
  LOG(INFO, "[Config] Configuring LCC packet printer");
  lccStack->print_all_packets();
#endif
}

void ConfigurationManager::setLCCHub(bool enabled)
{
  bool upd = false;
  CDI_COMPARE_AND_SET(cfg_.seg().wifi().hub().enable, configFd_, enabled, upd);
  MAYBE_TRIGGER_UPDATE(upd);
}

bool ConfigurationManager::setLCCCan(bool enabled)
{
  if (csConfig[JSON_LCC_NODE][JSON_LCC_CAN_NODE][JSON_LCC_CAN_ENABLED_NODE] != enabled)
  {
    csConfig[JSON_LCC_NODE][JSON_LCC_CAN_NODE][JSON_LCC_CAN_ENABLED_NODE] = enabled;
    persistConfig();
    SCHEDULE_REBOOT();
    return true;
  }
  return false;
}

bool ConfigurationManager::setWiFiMode(string mode)
{
  string current_mode = csConfig[JSON_WIFI_NODE][JSON_WIFI_MODE_NODE];
  if (current_mode.compare(mode))
  {
    LOG(INFO
      , "[Config] Updating WiFi mode from %s to %s, restart will be required."
      , current_mode.c_str(), mode.c_str());
    csConfig[JSON_WIFI_NODE][JSON_WIFI_MODE_NODE] = mode;
    persistConfig();
    SCHEDULE_REBOOT();
    return true;
  }
  return false;
}

bool ConfigurationManager::setWiFiStationParams(string ssid, string password
                                              , string ip, string gateway
                                              , string subnet)
{
  bool reboot_needed = false;
  string wifimode = csConfig[JSON_WIFI_NODE][JSON_WIFI_MODE_NODE];
  if (!wifimode.compare(JSON_VALUE_WIFI_MODE_SOFTAP_ONLY))
  {
    LOG(INFO, "[Config] Current config is SoftAP only, enabling Station mode");
    csConfig[JSON_WIFI_NODE][JSON_WIFI_MODE_NODE] = JSON_VALUE_WIFI_MODE_SOFTAP_STATION;
    reboot_needed = true;
  }
  LOG(INFO, "[Config] Reconfiguring Station SSID to '%s'", ssid.c_str());
  if (!ssid.empty())
  {
    csConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_SSID_NODE] = ssid;
    csConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_PASSWORD_NODE] = password;
    reboot_needed = true;
  }
  if (ip.empty())
  {
    auto station = csConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE];
    if (!station.contains(JSON_WIFI_MODE_NODE) ||
        station[JSON_WIFI_MODE_NODE].get<string>().compare(JSON_VALUE_STATION_IP_MODE_DHCP))
    {
      LOG(INFO, "[Config] Reconfiguring Station IP mode to DHCP");
      csConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_MODE_NODE] = JSON_VALUE_STATION_IP_MODE_DHCP;
      csConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_STATION_IP_NODE] = "";
      csConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_STATION_GATEWAY_NODE] = "";
      csConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_STATION_NETMASK_NODE] = "";
      reboot_needed = true;
    }
  }
  else
  {
    LOG(INFO
      , "[Config] Reconfiguring Station IP mode to STATIC using:\n"
        "ip: %s\n gateway: %s\nsubnet: %s"
      , ip.c_str(), gateway.c_str(), subnet.c_str());
    csConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_MODE_NODE] = JSON_VALUE_STATION_IP_MODE_STATIC;
    csConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_STATION_IP_NODE] = ip;
    csConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_STATION_GATEWAY_NODE] = gateway;
    csConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_STATION_NETMASK_NODE] = subnet;
    reboot_needed = true;
  }
  persistConfig();
  if (reboot_needed)
  {
    SCHEDULE_REBOOT();
  }
  return reboot_needed;
}

void ConfigurationManager::setWiFiUplinkParams(SocketClientParams::SearchMode mode
                                             , string uplink_service_name
                                             , string manual_hostname
                                             , uint16_t manual_port)
{
  auto wifi = cfg_.seg().wifi();
  bool upd = false;
  CDI_COMPARE_AND_SET(wifi.uplink().search_mode, configFd_, mode, upd);
  CDI_COMPARE_AND_SET(wifi.uplink().auto_address().service_name, configFd_
                    , uplink_service_name, upd);
  CDI_COMPARE_AND_SET(wifi.uplink().manual_address().ip_address, configFd_
                    , manual_hostname, upd);
  CDI_COMPARE_AND_SET(wifi.uplink().manual_address().port, configFd_
                    , manual_port, upd);

  MAYBE_TRIGGER_UPDATE(upd);
}

void ConfigurationManager::setHBridgeEvents(uint8_t index
                                          , string evt_short_on, string evt_short_off
                                          , string evt_shutdown_on, string evt_shutdown_off
                                          , string evt_thermal_on, string evt_thermal_off)
{
  bool upd = false;
  auto hbridge = cfg_.seg().hbridge().entry(index);
  CDI_COMPARE_AND_SET(hbridge.event_short, configFd_
                    , string_to_uint64(evt_short_on), upd);
  CDI_COMPARE_AND_SET(hbridge.event_short_cleared, configFd_
                    , string_to_uint64(evt_short_off), upd);
  CDI_COMPARE_AND_SET(hbridge.event_shutdown, configFd_
                    , string_to_uint64(evt_shutdown_on), upd);
  CDI_COMPARE_AND_SET(hbridge.event_shutdown_cleared, configFd_
                    , string_to_uint64(evt_shutdown_off), upd);
  // only OPS has the thermal pin
  if (index == OPS_CDI_TRACK_OUTPUT_INDEX)
  {
    CDI_COMPARE_AND_SET(hbridge.event_thermal_shutdown, configFd_
                      , string_to_uint64(evt_thermal_on), upd);
    CDI_COMPARE_AND_SET(hbridge.event_thermal_shutdown_cleared, configFd_
                      , string_to_uint64(evt_thermal_off), upd);
  }
  MAYBE_TRIGGER_UPDATE(upd);
}

