axf33480/ESP32CommandStation/main/ConfigurationManager.cpp
string ConfigurationManager::getFilePath(const string &name)
{
  return StringPrintf("%s/%s", CS_CONFIG_DIR, name.c_str());
}

void ConfigurationManager::persistConfig()
{
  OSMutexLock l(&configMux_);
  LOG(INFO, "[Config] Persisting configuration settings");
  const std::vector<string> non_persistent_cdi_entries{JSON_CDI_UPLINK_NODE
                                                     , JSON_CDI_HUB_NODE
                                                     , JSON_HBRIDGES_NODE};
  for (auto &entry : non_persistent_cdi_entries)
  {
    auto pos = csConfig[JSON_CDI_NODE].find(entry);
    if (pos != csConfig[JSON_CDI_NODE].end())
    {
      LOG(INFO
        , "[Config] Removing non-persistent config section: %s"
        , entry.c_str());
      csConfig[JSON_CDI_NODE].erase(pos);
    }
  }

  store(ESP32_CS_CONFIG_JSON, csConfig.dump());
}

bool ConfigurationManager::validateConfiguration()
{
  OSMutexLock l(&configMux_);
  if (!csConfig.contains(JSON_WIFI_NODE))
  {
    LOG_ERROR("[Config] WiFi configuration not found.");
    return false;
  }
  else if (!csConfig.contains(JSON_LCC_NODE))
  {
    LOG_ERROR("[Config] LCC configuration not found.");
    return false;
  }
  else if (!csConfig.contains(JSON_HBRIDGES_NODE))
  {
    LOG_ERROR("[Config] H-Bridge configuration not found.");
    return false;
  }

  auto wifiNode = csConfig[JSON_WIFI_NODE];
  LOG(VERBOSE, "[Config] WiFi config: %s", wifiNode.dump().c_str());

  // Verify that the wifi operating mode is one of the three supported
  // modes.
  string wifiMode = wifiNode[JSON_WIFI_MODE_NODE];
  if (wifiMode.compare(JSON_VALUE_WIFI_MODE_SOFTAP_ONLY) &&
      wifiMode.compare(JSON_VALUE_WIFI_MODE_SOFTAP_STATION) &&
      wifiMode.compare(JSON_VALUE_WIFI_MODE_STATION_ONLY))
  {
    LOG_ERROR("[Config] Unknown WiFi operating mode: %s!", wifiMode.c_str());
    return false;
  }

  // If we are not operating in AP only mode we should verify we have
  // an SSID.
  if (wifiMode.compare(JSON_VALUE_WIFI_MODE_SOFTAP_ONLY) &&
    (!wifiNode[JSON_WIFI_STATION_NODE].contains(JSON_WIFI_SSID_NODE) ||
     !wifiNode[JSON_WIFI_STATION_NODE].contains(JSON_WIFI_PASSWORD_NODE)))
  {
    LOG_ERROR("[Config] SSID/Password was not specified for Station mode!");
    return false;
  }

  // If we are operating in SoftAP only we require a default SSID name
  if (!wifiMode.compare(JSON_VALUE_WIFI_MODE_SOFTAP_ONLY) &&
      !wifiNode[JSON_WIFI_SOFTAP_NODE].contains(JSON_WIFI_SSID_NODE))
  {
    LOG_ERROR("[Config] SSID was not specified for SoftAP mode!");
    return false;
  }

  // verify LCC configuration
  auto lccNode = csConfig[JSON_LCC_NODE];
  LOG(VERBOSE, "[Config] LCC config: %s", lccNode.dump().c_str());

  if (!lccNode.contains(JSON_LCC_NODE_ID_NODE) ||
      lccNode[JSON_LCC_NODE_ID_NODE].get<uint64_t>() == 0)
  {
    LOG_ERROR("[Config] Missing LCC node ID!");
    return false;
  }

  if (!lccNode.contains(JSON_LCC_CAN_NODE) ||
      !lccNode[JSON_LCC_CAN_NODE].contains(JSON_LCC_CAN_RX_NODE) ||
      !lccNode[JSON_LCC_CAN_NODE].contains(JSON_LCC_CAN_TX_NODE) ||
      !lccNode[JSON_LCC_CAN_NODE].contains(JSON_LCC_CAN_ENABLED_NODE))
  {
    LOG_ERROR("[Config] LCC CAN configuration invalid.");
    return false;
  }

  // verify h-bridge configuration
  auto hbridges = csConfig[JSON_HBRIDGES_NODE];
  if (!hbridges.contains(CONFIG_OPS_TRACK_NAME))
  {
    LOG_ERROR("[Config] H-Bridge configuration invalid (missing OPS).");
    return false;
  }
  else if (!hbridges.contains(CONFIG_PROG_TRACK_NAME))
  {
    LOG_ERROR("[Config] H-Bridge configuration invalid (missing PROG).");
    return false;
  }

  return true;
}

bool ConfigurationManager::seedDefaultConfigSections()
{
  bool config_updated{false};

  // If LCC config is missing default it.
  if (!csConfig.contains(JSON_LCC_NODE))
  {
    csConfig[JSON_LCC_NODE] =
    {
      { JSON_LCC_NODE_ID_NODE, UINT64_C(CONFIG_LCC_NODE_ID) },
      { JSON_LCC_CAN_NODE,
        {
#if CONFIG_LCC_CAN_ENABLED
          { JSON_LCC_CAN_ENABLED_NODE, (bool)(CONFIG_LCC_CAN_ENABLED) },
          { JSON_LCC_CAN_RX_NODE, CONFIG_LCC_CAN_RX_PIN },
          { JSON_LCC_CAN_TX_NODE, CONFIG_LCC_CAN_TX_PIN },
#else
          { JSON_LCC_CAN_ENABLED_NODE, false },
          { JSON_LCC_CAN_RX_NODE, NOT_A_PIN },
          { JSON_LCC_CAN_TX_NODE, NOT_A_PIN },
#endif
        }
      },
      { JSON_LCC_FORCE_RESET_NODE, false },
    };
    config_updated = true;
  }
  // If LCC config is missing default it.
  if (!csConfig.contains(JSON_WIFI_NODE))
  {
    csConfig[JSON_WIFI_NODE] =
    {
#if CONFIG_WIFI_MODE_SOFTAP
      { JSON_WIFI_MODE_NODE, JSON_VALUE_WIFI_MODE_SOFTAP_ONLY },
      { JSON_WIFI_SOFTAP_NODE,
        {
          { JSON_WIFI_SSID_NODE, CONFIG_WIFI_SOFTAP_SSID },
        },
      },
#elif CONFIG_WIFI_MODE_SOFTAP_STATION
      { JSON_WIFI_MODE_NODE, JSON_VALUE_WIFI_MODE_SOFTAP_STATION },
      { JSON_WIFI_SOFTAP_NODE,
        {
          { JSON_WIFI_SSID_NODE, CONFIG_WIFI_SOFTAP_SSID },
        },
      },
#else
      { JSON_WIFI_MODE_NODE, JSON_VALUE_WIFI_MODE_STATION_ONLY },
#endif
#if CONFIG_WIFI_STATIC_IP_DNS
      { JSON_WIFI_DNS_NODE, WIFI_STATIC_IP_DNS },
#endif
#if CONFIG_WIFI_MODE_SOFTAP_STATION || CONFIG_WIFI_MODE_STATION
      { JSON_WIFI_STATION_NODE, 
        {
#if CONFIG_WIFI_IP_STATIC
          { JSON_WIFI_MODE_NODE, JSON_VALUE_STATION_IP_MODE_STATIC },
          { JSON_WIFI_STATION_IP_NODE, CONFIG_WIFI_STATIC_IP_ADDRESS },
          { JSON_WIFI_STATION_GATEWAY_NODE, CONFIG_WIFI_STATIC_IP_GATEWAY },
          { JSON_WIFI_STATION_NETMASK_NODE, CONFIG_WIFI_STATIC_IP_SUBNET },
#else
          { JSON_WIFI_MODE_NODE, JSON_VALUE_STATION_IP_MODE_DHCP },
#endif
          { JSON_WIFI_SSID_NODE, CONFIG_WIFI_SSID },
          { JSON_WIFI_PASSWORD_NODE, CONFIG_WIFI_PASSWORD },
        }
      },
#endif
    };
    config_updated = true;
  }
  // If HC12 config is missing default it.
  if (!csConfig.contains(JSON_HC12_NODE))
  {
    csConfig[JSON_HC12_NODE] =
    {
#if CONFIG_HC12
      { JSON_HC12_ENABLED_NODE, (bool)CONFIG_HC12 },
#if HC12_UART_UART1
      { JSON_HC12_UART_NODE, 1 },
#elif HC12_UART_UART2
      { JSON_HC12_UART_NODE, 2 },
#else
#error unsupported HC12 UART selection.
#endif
      { JSON_HC12_RX_NODE, CONFIG_HC12_RTX_PIN },
      { JSON_HC12_TX_NODE, CONFIG_HC12_TX_PIN },
#else
      { JSON_HC12_ENABLED_NODE, false },
      { JSON_HC12_UART_NODE, 1 },
      { JSON_HC12_RX_NODE, NOT_A_PIN },
      { JSON_HC12_TX_NODE, NOT_A_PIN },
#endif
    };
    // flag to indicate we need to persist the configuration update
    config_updated = true;
  }
  // If HBridge config is missing default it.
  if (!csConfig.contains(JSON_HBRIDGES_NODE))
  {
    csConfig[JSON_HBRIDGES_NODE] =
    {
      { CONFIG_OPS_TRACK_NAME,
        {
          { JSON_HBRIDGE_PREAMBLE_BITS_NODE, CONFIG_OPS_PREAMBLE_BITS },
          { JSON_HBRIDGE_RMT_CHANNEL_NODE, RMT_CHANNEL_0 },
          { JSON_HBRIDGE_ENABLE_PIN_NODE, CONFIG_OPS_ENABLE_PIN },
          { JSON_HBRIDGE_SIGNAL_PIN_NODE, CONFIG_OPS_SIGNAL_PIN },
#if defined(CONFIG_OPS_THERMAL_PIN)
          { JSON_HBRIDGE_THERMAL_PIN_NODE, CONFIG_OPS_THERMAL_PIN },
#else
          { JSON_HBRIDGE_THERMAL_PIN_NODE, NOT_A_PIN },
#endif
          { JSON_HBRIDGE_SENSE_PIN_NODE, CONFIG_OPS_ADC },
#if OPS_RAILCOM_ENABLED
          { JSON_RAILCOM_NODE, (bool)OPS_RAILCOM_ENABLED }
#else
          { JSON_RAILCOM_NODE, false }
#endif
        },
      },
      { CONFIG_PROG_TRACK_NAME,
        {
          { JSON_HBRIDGE_PREAMBLE_BITS_NODE, CONFIG_PROG_PREAMBLE_BITS },
          { JSON_HBRIDGE_RMT_CHANNEL_NODE, RMT_CHANNEL_1 },
          { JSON_HBRIDGE_ENABLE_PIN_NODE, CONFIG_PROG_ENABLE_PIN },
          { JSON_HBRIDGE_SIGNAL_PIN_NODE, CONFIG_PROG_SIGNAL_PIN },
          { JSON_HBRIDGE_SENSE_PIN_NODE, CONFIG_PROG_ADC },
        },
      }
    };
    // flag to indicate we need to persist the configuration update
    config_updated = true;
  }
  // If RailCom config is missing default it.
  if (!csConfig.contains(JSON_RAILCOM_NODE))
  {
    csConfig[JSON_RAILCOM_NODE] =
    {
#if CONFIG_OPS_RAILCOM
      { JSON_RAILCOM_ENABLE_PIN_NODE, CONFIG_OPS_RAILCOM_ENABLE_PIN },
      { JSON_RAILCOM_BRAKE_PIN_NODE, CONFIG_OPS_RAILCOM_BRAKE_ENABLE_PIN },
      { JSON_RAILCOM_SHORT_PIN_NODE, CONFIG_OPS_RAILCOM_SHORT_PIN },
      { JSON_RAILCOM_UART_NODE, CONFIG_OPS_RAILCOM_UART },
      { JSON_RAILCOM_RX_NODE, CONFIG_OPS_RAILCOM_UART_RX_PIN },
#else
      { JSON_RAILCOM_ENABLE_PIN_NODE, NOT_A_PIN },
      { JSON_RAILCOM_BRAKE_PIN_NODE, NOT_A_PIN },
      { JSON_RAILCOM_SHORT_PIN_NODE, NOT_A_PIN },
      { JSON_RAILCOM_UART_NODE, 2 },
      { JSON_RAILCOM_RX_NODE, NOT_A_PIN },
#endif
    };
    // flag to indicate we need to persist the configuration update
    config_updated = true;
  }
  return config_updated;
}

