axf33480/ESP32CommandStation/main/ConfigurationManager.cpp
void ConfigurationManager::parseWiFiConfig()
{
  auto wifiConfig = csConfig[JSON_WIFI_NODE];
  string wifiMode = wifiConfig[JSON_WIFI_MODE_NODE];
  if (!wifiMode.compare(JSON_VALUE_WIFI_MODE_SOFTAP_ONLY))
  {
    wifiMode_ =  WIFI_MODE_AP;
  }
  else if (!wifiMode.compare(JSON_VALUE_WIFI_MODE_SOFTAP_STATION))
  {
    wifiMode_ =  WIFI_MODE_APSTA;
  }
  else if (!wifiMode.compare(JSON_VALUE_WIFI_MODE_STATION_ONLY))
  {
    wifiMode_ =  WIFI_MODE_STA;
  }
  if (wifiMode_ != WIFI_MODE_AP)
  {
    auto stationConfig = wifiConfig[JSON_WIFI_STATION_NODE];
    wifiSSID_ = stationConfig[JSON_WIFI_SSID_NODE];
    wifiPassword_ = stationConfig[JSON_WIFI_PASSWORD_NODE];
    string stationMode = stationConfig[JSON_WIFI_MODE_NODE];
    if (!stationMode.compare(JSON_VALUE_STATION_IP_MODE_STATIC))
    {
      stationStaticIP_.reset(new tcpip_adapter_ip_info_t());
      string value = stationConfig[JSON_WIFI_STATION_IP_NODE];
      stationStaticIP_->ip.addr = ipaddr_addr(value.c_str());
      value = stationConfig[JSON_WIFI_STATION_GATEWAY_NODE];
      stationStaticIP_->gw.addr = ipaddr_addr(value.c_str());
      value = stationConfig[JSON_WIFI_STATION_NETMASK_NODE];
      stationStaticIP_->netmask.addr = ipaddr_addr(value.c_str());
    }
  }
  else
  {
    wifiSSID_ = wifiConfig[JSON_WIFI_SOFTAP_NODE][JSON_WIFI_SSID_NODE];
  }
  if (wifiConfig.contains(JSON_WIFI_DNS_NODE))
  {
    string value = wifiConfig[JSON_WIFI_DNS_NODE];
    stationDNSServer_.u_addr.ip4.addr = ipaddr_addr(value.c_str());
  }
}

void ConfigurationManager::configureEnabledModules()
{
#ifdef DEDICATED_MODULE_EXECUTOR
  Service *service = &moduleService;
#else
  Service *service = lccStack->service();
#endif
  parseWiFiConfig();
  LOG(INFO, "[Config] Registering WiFi Manager");
  wifiManager.reset(new Esp32WiFiManager(wifiSSID_.c_str()
                                       , wifiPassword_.c_str()
                                       , lccStack.get()
                                       , cfg_.seg().wifi()
                                       , CONFIG_HOSTNAME_PREFIX
                                       , wifiMode_
                                       , stationStaticIP_.get()
                                       , stationDNSServer_
                                       , CONFIG_WIFI_SOFT_AP_CHANNEL));

  // Initialize the turnout manager and register it with the LCC stack to
  // process accessories packets.
  turnoutManager.reset(new TurnoutManager(lccStack->node(), service));

  auto hc12Config = csConfig[JSON_HC12_NODE];
  if (hc12Config[JSON_HC12_ENABLED_NODE].get<bool>())
  {
    LOG(INFO, "[Config] Enabling HC12 Radio");
    hc12_.emplace(service
                , (uart_port_t)hc12Config[JSON_HC12_UART_NODE].get<uint8_t>()
                , (gpio_num_t)hc12Config[JSON_HC12_RX_NODE].get<uint8_t>()
                , (gpio_num_t)hc12Config[JSON_HC12_TX_NODE].get<uint8_t>()
    );
  }
  LOG(INFO, "[Config] Registering OTA monitor");
  ota_.emplace(service);
  LOG(INFO, "[Config] Registering StatusDisplay module");
  statusDisplay_.emplace(lccStack.get(), service);
  LOG(INFO, "[Config] Registering StatusLED module");
  statusLED_.emplace(service);

  // Task Monitor, periodically dumps runtime state to STDOUT.
  LOG(INFO, "[Config] Registering FreeRTOS Task Monitor");
  taskMon_.emplace(service);

  LOG(INFO, "[Config] Registering WiFi handlers (JMRI, WebServer)");
  wifiInterface.init();

#if CONFIG_NEXTION
  LOG(INFO, "[Config] Enabling Nextion module");
  nextionInterfaceInit();
#endif

#if CONFIG_OUTPUTS
  LOG(INFO, "[Config] Enabling GPIO Outputs");
  OutputManager::init();
#endif

#if CONFIG_SENSORS
  LOG(INFO, "[Config] Enabling GPIO Inputs");
  SensorManager::init();
  S88BusManager::init();
  RemoteSensorManager::init();
#endif

#if CONFIG_LOCONET
  LOG(INFO, "[Config] Enabling LocoNet interface");
  initializeLocoNet();
#endif
}

string ConfigurationManager::getCSConfig()
{
  OSMutexLock l(&configMux_);
  openlcb::TcpClientConfig<openlcb::TcpClientDefaultParams> uplink =
    cfg_.seg().wifi().uplink();
  openmrn_arduino::HubConfiguration hub = cfg_.seg().wifi().hub();
  esp32cs::TrackOutputConfig ops = cfg_.seg().hbridge().entry(0);
  esp32cs::TrackOutputConfig prog = cfg_.seg().hbridge().entry(1);

  // insert non-persistent CDI elements that we can modify from web
  csConfig[JSON_CDI_NODE][JSON_CDI_UPLINK_NODE] =
  {
    {JSON_CDI_UPLINK_RECONNECT_NODE,
      CDI_READ_TRIMMED(uplink.reconnect, configFd_)},
    {JSON_CDI_UPLINK_MODE_NODE,
      CDI_READ_TRIMMED(uplink.search_mode, configFd_)},
    {JSON_CDI_UPLINK_AUTO_HOST_NODE,
      uplink.auto_address().host_name().read(configFd_)},
    {JSON_CDI_UPLINK_AUTO_SERVICE_NODE,
      uplink.auto_address().service_name().read(configFd_)},
    {JSON_CDI_UPLINK_MANUAL_HOST_NODE,
      uplink.manual_address().ip_address().read(configFd_)},
    {JSON_CDI_UPLINK_MANUAL_PORT_NODE,
      CDI_READ_TRIMMED(uplink.manual_address().port, configFd_)},
  };
  csConfig[JSON_CDI_NODE][JSON_CDI_HUB_NODE] =
  {
    {JSON_CDI_HUB_ENABLE_NODE, CDI_READ_TRIMMED(hub.enable, configFd_)},
    {JSON_CDI_HUB_PORT_NODE, CDI_READ_TRIMMED(hub.port, configFd_)},
    {JSON_CDI_HUB_SERVICE_NODE, hub.service_name().read(configFd_)},
  };
  csConfig[JSON_CDI_NODE][JSON_HBRIDGES_NODE] =
  {
    {CONFIG_OPS_TRACK_NAME,
      {
        {JSON_DESCRIPTION_NODE, ops.description().read(configFd_)},
        {JSON_CDI_HBRIDGE_SHORT_EVENT_NODE,
          uint64_to_string_hex(ops.event_short().read(configFd_))},
        {JSON_CDI_HBRIDGE_SHORT_CLEAR_EVENT_NODE,
          uint64_to_string_hex(ops.event_short_cleared().read(configFd_))},
        {JSON_CDI_HBRIDGE_SHUTDOWN_EVENT_NODE,
          uint64_to_string_hex(ops.event_shutdown().read(configFd_))},
        {JSON_CDI_HBRIDGE_SHUTDOWN_CLEAR_EVENT_NODE,
          uint64_to_string_hex(ops.event_shutdown_cleared().read(configFd_))},
        {JSON_CDI_HBRIDGE_THERMAL_EVENT_NODE,
          uint64_to_string_hex(ops.event_thermal_shutdown().read(configFd_))},
        {JSON_CDI_HBRIDGE_THERMAL_CLEAR_EVENT_NODE,
          uint64_to_string_hex(ops.event_thermal_shutdown_cleared().read(configFd_))},
      }
    },
    {CONFIG_PROG_TRACK_NAME,
      {
        {JSON_DESCRIPTION_NODE, prog.description().read(configFd_)},
        {JSON_CDI_HBRIDGE_SHORT_EVENT_NODE,
          uint64_to_string_hex(prog.event_short().read(configFd_))},
        {JSON_CDI_HBRIDGE_SHORT_CLEAR_EVENT_NODE,
          uint64_to_string_hex(prog.event_short_cleared().read(configFd_))},
        {JSON_CDI_HBRIDGE_SHUTDOWN_EVENT_NODE,
          uint64_to_string_hex(prog.event_shutdown().read(configFd_))},
        {JSON_CDI_HBRIDGE_SHUTDOWN_CLEAR_EVENT_NODE,
          uint64_to_string_hex(prog.event_shutdown_cleared().read(configFd_))},
      }
    },
  };
  return csConfig.dump();
}

string ConfigurationManager::getCSFeatures()
{
  json features = 
  {
    { JSON_S88_SENSOR_BASE_NODE, CONFIG_S88_FIRST_SENSOR }
#if CONFIG_S88 && CONFIG_ENABLE_SENSORS
  , { JSON_S88_NODE, JSON_VALUE_TRUE }
#else
  , { JSON_S88_NODE, JSON_VALUE_FALSE }
#endif
#if CONFIG_ENABLE_OUTPUTS
  , { JSON_OUTPUTS_NODE, JSON_VALUE_TRUE }
#else
  , { JSON_OUTPUTS_NODE, JSON_VALUE_FALSE }
#endif
#if CONFIG_ENABLE_SENSORS
  , { JSON_SENSORS_NODE, JSON_VALUE_TRUE }
#else
  , { JSON_SENSORS_NODE, JSON_VALUE_FALSE }
#endif
  , { JSON_HC12_NODE
    , csConfig[JSON_HC12_NODE][JSON_HC12_ENABLED_NODE].get<bool>() }
  };
  return features.dump();
}
